Merge branch 'main' into feature/SY002002-get-job-progress-integration
